Tekla Open API Reference for Tekla Structures 2025
Double Constructor
 Creates a new double datatype instance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Double(
	double value
)
Public Sub New (
	value As Double
)
Parameters
value
Type: System.Double
The value for the double datatype.
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace